[
  {
    "id": 1,
    "titre": "Ne tirez pas sur l'oiseau moqueur --",
    "auteur": "Harper Lee",
    "prix": 12.99,
    "description": "Ne tirez pas sur l'oiseau moqueur est un roman de Harper Lee publié en 1960. C'est un classique de la littérature américaine moderne."
  },
  {
    "id": 2,
    "titre": "1984",
    "auteur": "George Orwell",
    "prix": 10.99,
    "description": "1984 est un roman dystopique de George Orwell publié en 1949. Il dépeint une société sous surveillance et contrôle totalitaires."
  },
  {
    "id": 3,
    "titre": "Orgueil et Préjugés",
    "auteur": "Jane Austen",
    "prix": 9.99,
    "description": "Orgueil et Préjugés est un roman romantique de Jane Austen publié en 1813. Il explore les thèmes de l'amour, de la classe sociale et des attentes sociétales."
  },
  {
    "id": 4,
    "titre": "Gatsby le Magnifique",
    "auteur": "F. Scott Fitzgerald",
    "prix": 11.49,
    "description": "Gatsby le Magnifique est un roman de F. Scott Fitzgerald publié en 1925. Il dépeint la décadence et la désillusion du rêve américain."
  },
  {
    "id": 6,
    "titre": "Le Vieil Homme et la Mer",
    "auteur": "Ernest Hemingway",
    "prix": 10.99,
    "description": "Le Vieil Homme et la Mer est un roman d'Ernest Hemingway publié en 1952. Il raconte l'histoire d'un vieux pêcheur et de sa lutte contre un énorme poisson."
  },
  {
    "id": 7,
    "titre": "Les Misérables",
    "auteur": "Victor Hugo",
    "prix": 12.99,
    "description": "Les Misérables est un roman de Victor Hugo publié en 1862. Il suit la vie de plusieurs personnages dans la France du XIXe siècle."
  },
  {
    "id": 8,
    "titre": "Le Petit Prince",
    "auteur": "Antoine de Saint-Exupéry",
    "prix": 9.99,
    "description": "Le Petit Prince est un conte philosophique d'Antoine de Saint-Exupéry publié en 1943. Il aborde des thèmes tels que l'amitié, l'amour et la quête de sens."
  },
  {
    "id": 9,
    "titre": "Vingt mille lieues sous les mers",
    "auteur": "Jules Verne",
    "prix": 12.99,
    "description": "Vingt mille lieues sous les mers est un roman de Jules Verne publié en 1870. Il relate les aventures du capitaine Nemo à bord du sous-marin Nautilus."
  },
  {
    "id": 10,
    "titre": "Le Comte de Monte-Cristo",
    "auteur": "Alexandre Dumas",
    "prix": 13.99,
    "description": "Le Comte de Monte-Cristo est un roman d'Alexandre Dumas publié en 1844. Il raconte l'histoire d'Edmond Dantès en quête de vengeance."
  },
  {
    "id": 11,
    "titre": "Le Rouge et le Noir",
    "auteur": "Stendhal",
    "prix": 10.99,
    "description": "Le Rouge et le Noir est un roman de Stendhal publié en 1830. Il met en scène Julien Sorel, un jeune homme ambitieux luttant pour s'élever dans la société."
  },
  {
    "id": 12,
    "titre": "Les Trois Mousquetaires",
    "auteur": "Alexandre Dumas",
    "prix": 11.49,
    "description": "Les Trois Mousquetaires est un roman d'Alexandre Dumas publié en 1844. Il relate les aventures d'Athos, Porthos, Aramis et d'Artagnan dans la France du XVIIe siècle."
  },
  {
    "id": 13,
    "titre": "Le Fantôme de l'Opéra",
    "auteur": "Gaston Leroux",
    "prix": 12.99,
    "description": "Le Fantôme de l'Opéra est un roman de Gaston Leroux publié en 1910. Il raconte l'histoire d'un mystérieux fantôme hantant l'Opéra Garnier à Paris."
  },
  {
    "id": 14,
    "titre": "Les Fleurs du Mal",
    "auteur": "Charles Baudelaire",
    "prix": 13.99,
    "description": "Les Fleurs du Mal est un recueil de poèmes de Charles Baudelaire publié en 1857. Il explore les thèmes de la beauté, de la sensualité et de la mortalité."
  },
  {
    "id": 15,
    "titre": "Madame Bovary",
    "auteur": "Gustave Flaubert",
    "prix": 12.99,
    "description": "Madame Bovary est un roman de Gustave Flaubert publié en 1856. Il raconte l'histoire d'Emma Bovary, une femme insatisfaite de sa vie conjugale."
  },
  {
    "id": 16,
    "titre": "Les Quatre Filles du docteur March",
    "auteur": "Louisa May Alcott",
    "prix": 9.99,
    "description": "Les Quatre Filles du docteur March est un roman de Louisa May Alcott publié en 1868. Il suit les vies des sœurs March pendant la Guerre de Sécession."
  },
  {
    "id": 17,
    "titre": "Le Père Goriot",
    "auteur": "Honoré de Balzac",
    "prix": 12.99,
    "description": "Le Père Goriot est un roman d'Honoré de Balzac publié en 1835. Il met en scène le personnage de Père Goriot, un homme sacrifiant tout pour ses filles."
  },
  {
    "id": 18,
    "titre": "Bel-Ami",
    "auteur": "Guy de Maupassant",
    "prix": 11.49,
    "description": "Bel-Ami est un roman de Guy de Maupassant publié en 1885. Il raconte l'ascension sociale de Georges Duroy dans le Paris de la fin du XIXe siècle."
  },
  {
    "id": 19,
    "titre": "Le Tour du monde en quatre-vingts jours",
    "auteur": "Jules Verne",
    "prix": 12.99,
    "description": "Le Tour du monde en quatre-vingts jours est un roman de Jules Verne publié en 1873. Il suit les aventures de Phileas Fogg dans son voyage autour du monde."
  },
  {
    "id": 20,
    "titre": "Les Misérables",
    "auteur": "Victor Hugo & Matias",
    "prix": 12.99,
    "description": "Les Misérables est un roman de Victor Hugo publié en 1862. Il suit la vie de plusieurs personnages dans la France du XIXe siècle."
  },
  {
    "titre": "test",
    "description": "sdhgfhzr",
    "auteur": "test",
    "prix": "100",
    "id": 21
  }
]